//
//  OnboardingView.swift
//  EVStation
//
//  Created by Narek Kirakosyan on 10.12.25.
//

import SwiftUI

struct OnboardingView: View {
    @Binding var showOnboarding: Bool
    
    var body: some View {
        ScrollView {
            VStack(alignment: .leading, spacing: 12) {
                HStack {
                    Text("EV Station")
                        .font(.title)
                        .multilineTextAlignment(.center)
                        .frame(maxWidth: .infinity)
                    Spacer()
                    Button {
                        showOnboarding = false
                    } label: {
                        Image(systemName: "xmark")
                            .foregroundStyle(.black)
                    }
                    
                }
                Text("🚗 Մեր տեսլականը")
                    .font(.title2)
                
                Text("Հայաստանում էլեկտրական մեքենաների թիվը աճում է, սակայն ներկայումս վարորդները բախվում են բաժանված լիցքավորման միջավայրի՝ յուրաքանչյուր ցանց ունի իր հավելվածը, գրանցման ձևը և վճարման մեթոդը։ Սա խոչընդոտում է EV-ների լայն կիրառմանը։Մեր նպատակն է ստեղծել ազգային մակարդակի համախմբող հարթակ, որը՝")
                
                row(text: "Ցուցադրում է բոլոր լիցքավորման կայանները մեկ քարտեզում, անկախ օպերատորից,")
                row(text: "Ապահովում է ռեալ-թայմ տեղեկատվություն՝ կայանի հասանելիության և գների վերաբերյալ,")
                row(text: "Առաջարկում է միասնական վճարային համակարգ (Idram, Telcell, կամ Apple Pay/Google Pay ինտեգրումով),")
                row(text: "Եվ ապահովում է արդար ու թափանցիկ եկամտի բաշխում յուրաքանչյուր գործընկեր օպերատորի հետ։")
                Text("⚙️ Տեխնիկական ինտեգրում")
                    .font(.title2)
                    .padding(.top, 12)
                Text("Առաջարկում ենք ինտեգրվել Ձեր ցանցի հետ բաց API-ների միջոցով կամ միջազգային ստանդարտներով՝ OCPP / OCPI։")
                Text("Եթե Ձեր համակարգը արդեն ունի նման ինտերֆեյս, մենք կարող ենք համաժամեցնել՝")
                row(text: "Կայանի տվյալները (հասցե, հզորություն, միակցիչների տեսակներ, հասանելիություն),")
                row(text: "Լիցքավորման նիստերի կառավարում (սկիզբ / ավարտ),")
                row(text: "Վճարային հոսք (ուղղակիորեն դեպի Ձեր համակարգ կամ ընդհանուր միջնորդավորված մոդելով)։")
                Text("Բոլոր ինտեգրացիաները կիրականացվեն Ձեր անվտանգության և բրենդային ուղեցույցներին համապատասխան։")
                Text("🤝 Առավելություններ [ընկերության անունի] համար")
                row(text: "Կայանների օգտագործման աճ և նոր հաճախորդների ներգրավում,")
                row(text: "Անվճար տեսանելիություն ազգային միասնական քարտեզում,")
                row(text: "Պարզ onboarding՝ նոր վարորդների համար,")
                row(text: "Բրենդավորման և մարքեթինգային հնարավորություններ մեր հավելվածում։")
                
                Text("🔋 Մեր հանձնառությունը")
                    .font(.title2)
                    .padding(.top, 12)
                Text("Մենք չենք մրցում գործող օպերատորների հետ․ մեր նպատակը համակցված միջավայր ստեղծելն է, որը շահավետ կլինի ինչպես Ձեզ, այնպես էլ EV վարորդներին։ Մենք հավատում ենք, որ Հայաստանը կարող է դառնալ տարածաշրջանի օրինակ՝ համագործակցային և օգտատերակենտրոն լիցքավորման ենթակառուցվածքով։")
            }
            .frame(maxWidth: .infinity)
            .padding(.horizontal, 12)
        }
    }
    
    private func row(text: String) -> some View {
        Text("* \(text)")
    }
}

#Preview {
    OnboardingView(showOnboarding: .constant(true))
}
